src/Catalogs/бит_НастройкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/бит_НастройкиУчета/Forms/ФормаОбщая/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройки();
	ПолучитьСписокВыбораПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполняетсяЗакрытие = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И ЭтаФорма.Модифицированность Тогда
		Отказ = Истина;
		ОповещениеВопрос = Новый ОписаниеОповещения("СохранитьНастройкиПослеВопроса", ЭтаФорма);
		ПоказатьВопрос(ОповещениеВопрос, "Имеются несохраненные данные, выполнить сохранение настроек?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	Если НЕ ПустаяСтрока(Поиск) Тогда
		Элемент = Элементы.Найти(Поиск);
		Если Элемент <> Неопределено Тогда
			ЭтаФорма.ТекущийЭлемент = Элемент;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНастройки();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписок(Команда)
	
	ОткрытьФорму("Справочник.бит_НастройкиУчета.ФормаСписка", Новый Структура("ОткрытиеФормыСписка"), , Новый УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройки()
	
	Для Каждого ПростаяНастройка Из ПолучитьСписокПростыхНастроек() Цикл
		Настройка = Справочники.бит_НастройкиУчета[ПростаяНастройка.ИмяНастройки]; 
		Если ЗначениеЗаполнено(ПростаяНастройка.ИмяКлюча) Тогда 
			ЭтаФорма[ПростаяНастройка.ИмяКлюча] = Настройка.Ключ;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПростаяНастройка.ИмяЗначения) Тогда 
			ЭтаФорма[ПростаяНастройка.ИмяЗначения] = Настройка.Значение;
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	НачатьТранзакцию();
	
	Для Каждого ПростаяНастройка Из ПолучитьСписокПростыхНастроек() Цикл
		НастройкаОбъект = Справочники.бит_НастройкиУчета[ПростаяНастройка.ИмяНастройки].ПолучитьОбъект();
		Если ЗначениеЗаполнено(ПростаяНастройка.ИмяКлюча) Тогда 
			НастройкаОбъект.Ключ = ЭтаФорма[ПростаяНастройка.ИмяКлюча];
		КонецЕсли;
		Если ЗначениеЗаполнено(ПростаяНастройка.ИмяЗначения) Тогда 
			НастройкаОбъект.Значение = ЭтаФорма[ПростаяНастройка.ИмяЗначения];
		КонецЕсли;
		НастройкаОбъект.Записать();
	КонецЦикла;
			
	ЗафиксироватьТранзакцию();
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПослеВопроса(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
	ВыполняетсяЗакрытие = Истина;
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройки();
		Закрыть();
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПростыхНастроек()
	
	ПростыеНастройки = Новый Массив;
	//ПРИМЕР КАК ДОБАВЛЯТЬ НАСТРОЙКИ:
	//1. Добавляем предопределенный элемент МояНастройка
	//2. Добавляем реквизит на форму с нужным типом данных
	//3. Вставляем строчку в эту функцию в таком формате:
	//	ПростыеНастройки.Добавить(Новый Структура("ИмяНастройки, ИмяКлюча, ИмяЗначения", "МояНастройка",, "МойРеквизитФормы"));
	
	Возврат ПростыеНастройки;
	
КонецФункции

&НаСервере
Процедура ПолучитьСписокВыбораПоиска()
	
	Массив = ЭтаФорма.ПолучитьРеквизиты();
	Соответствие = Новый Соответствие;
	
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И ЗначениеЗаполнено(Элемент.ПутьКДанным) И Элемент <> Элементы._Поиск Тогда
			Для Каждого Реквизит Из Массив Цикл
				Если Элемент.ПутьКДанным = Реквизит.Имя Тогда
					Соответствие.Вставить(Реквизит, Элемент);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого соотЭлемент Из Соответствие Цикл
		Если ТипЗнч(соотЭлемент.Значение) = Тип("ПолеФормы") Тогда
			Если ЗначениеЗаполнено(соотЭлемент.Значение.ПутьКДанным) Тогда
				Элементы._Поиск.СписокВыбора.Добавить(соотЭлемент.Значение.Имя, ?(НЕ ПустаяСтрока(соотЭлемент.Значение.Заголовок), соотЭлемент.Значение.Заголовок, соотЭлемент.Ключ.Заголовок));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Элементы._Поиск.СписокВыбора.СортироватьПоПредставлению();

КонецПроцедуры

#КонецОбласти
